Repository: daerentis/ibantest-for-woocommerce
Catalog: languages/woocommerce-ibantest-*.po
Languages: de_de

source: Provides direct debit payment with IBAN and BIC validation for WooCommerce
de_de: Bietet Lastschriftzahlung mit IBAN- und BIC-Validierung für WooCommerce

source: Will be notified separately
de_de: Wird gesondert benachrichtigt

source: Nope
de_de: Nein

source: Order %s
de_de: Bestellung %s

source: SEPA Direct Debit (IBANTEST)
de_de: SEPA Lastschrift (IBANTEST)

source: add SEPA Direct Debit as payment method
de_de: SEPA-Lastschrift als Zahlungsmethode hinzufügen

source: Account Holder
de_de: Kontoinhaber

source: Please agree to SEPA mandate.
de_de: Bitte stimmen Sie dem SEPA-Mandat zu.

source: Please insert your IBAN.
de_de: Bitte geben Sie Ihre IBAN ein.

source: Please insert the account holder.
de_de: Bitte geben Sie den Kontoinhaber ein.

source: Your BIC is invalid.
de_de: Die eingegebene BIC ist ungültig.

source: Awaiting Direct Debit Payment
de_de: Warten auf Zahlung per Bankeinzug

source: Payment notice:
de_de: Zahlungsaufforderung:

source: The order amount will be debited directly from your bank account.
de_de: Der Betrag wird direkt von Ihrem Bankkonto abgebucht.

source: Direct debit
de_de: Lastschrift

source: Mandate Reference ID
de_de: Mandat Referenz-ID

source: We will debit %s from your account by direct debit on or shortly after %s.
de_de: Wir buchen %s von Ihrem Konto per Lastschrift am oder kurz nach dem %s ab.

source: If you like <b>IBANTEST for Woocommerce</b> please leave us a %1$s rating. A huge thanks in advance!
de_de: Wenn Sie <b>IBANTEST for Woocommerce</b> mögen, geben Sie uns bitte ein %1$s Rating. Ein großes Dankeschön im Voraus!

source: IBAN has not the correct length
de_de: IBAN hat nicht die richtige Länge

source: IBAN contains an incorrect checksum
de_de: IBAN enthält eine falsche Prüfsumme

source: IBAN structure is incorrect
de_de: IBAN-Struktur ist falsch

source: The account number checksum is incorrect
de_de: Die Kontonummer-Prüfsumme ist falsch

source: This bank code does not exist
de_de: Diese Bankleitzahl existiert nicht

source: IBANTEST: API Key is not configured
de_de: IBANTEST: API-Schlüssel ist nicht konfiguriert

source: IBANTEST: No credits available
de_de: IBANTEST: Keine Credits verfügbar

source: IBANTEST: verification failed. Please check your API Key %s
de_de: IBANTEST: Überprüfung fehlgeschlagen. Bitte überprüfen Sie Ihren API-Schlüssel %s

source: Settings
de_de: Einstellungen

source: Enable/Disable SEPA Direct Debit
de_de: SEPA-Lastschrift aktivieren/deaktivieren

source: Enable SEPA Direct Debit
de_de: SEPA-Lastschrift aktivieren

source: Title
de_de: Titel

source: Payment method title.
de_de: Titel der Zahlungsmethode.

source: SEPA Direct Debit
de_de: SEPA-Lastschriftverfahren

source: Description
de_de: Beschreibung

source: Payment method description.
de_de: Beschreibung der Zahlungsmethode.

source: Pay conveniently by SEPA Direct Debit.
de_de: Bezahlen Sie bequem per SEPA-Lastschrift.

source: IBANTEST API credentials
de_de: IBANTEST API-Anmeldeinformationen

source: Create your IBANTEST account now and <b>receive 100 credits for free</b>. <br />- no annual fee<br />- no setup fee <br /> <a href="https://www.ibantest.com/">https://www.ibantest.com</a>
de_de: Erstellen Sie jetzt Ihr IBANTEST-Konto und erhalten Sie 100 Credits gratis </b>. <br />- keine Jahresgebühr<br />- keine Einrichtungsgebühr <br /> <a href="https://www.ibantest.com/">https://www.ibantest.com</a>

source: IBANTEST API Key
de_de: IBANTEST API-Schlüssel

source: Get your API keys from your IBANTEST account.
de_de: Holen Sie sich Ihre API-Schlüssel von Ihrem IBANTEST-Konto.

source: Encryption
de_de: Verschlüsselung

source: SEPA creditor payment information
de_de: SEPA-Gläubiger-Zahlungsinformationen

source: Company name
de_de: Firmenname

source: Company account holder
de_de: Inhaber des Firmenkontos

source: Company account IBAN
de_de: Firmenkonto IBAN

source: Company account BIC
de_de: Firmenkonto IBAN

source: Company identification number
de_de: Identifikationsnummer des Unternehmens

source: Choose the correct format for the SEPA XML export. Please ask your bank what format is required.
de_de: Wählen Sie das richtige Format für den SEPA-XML-Export. Bitte fragen Sie Ihre Bank nach dem gewünschten Format.

source: SEPA-Mandate
de_de: SEPA-Mandat

source: SEPA Mandate Text
de_de: SEPA-Mandatstext

source: [creditor_name] debtee identification number: [creditor_id] mandate reference number: [mandate_id]. <h4>SEPA Direct Debit Mandate</h4> I/We herewith authorise you to collect payments from my/our account by direct debit. At the same time, I/we instruct my/our bank to honour direct debits drawn by Note: I/We can demand reimbursement of the debited amount within eight weeks, starting with the debit date. The transaction is subject to the conditions agreed with my/our bank. <strong>Debtor:</strong> Account holder: [creditor_account_holder] Street: [street] Postcode: [postcode] City: [city] Country: [country] IBAN: [creditor_account_iban] BIC: [creditor_agent_bic] [city], [date], [creditor_account_holder] This letter is done automatically and is valid without signature. <hr/> Please notice: Period for pre-information of the SEPA direct debit is shortened to one day.
de_de: [creditor_name] Debitoren-Identifikationsnummer: [creditor_id] Referenznummer des Mandats: [mandate_id]. <h4>SEPA Einzugsermächtigung </h4> Ich/Wir ermächtige(n) Sie hiermit, Zahlungen von meinem/unserem Konto per Lastschrift einzuziehen. Gleichzeitig beauftrage ich/wir meine/unsere Bank mit der Einlösung von Lastschriften von Hinweis: Ich/Wir können die Rückerstattung des belasteten Betrages innerhalb von acht Wochen, beginnend mit dem Belastungsdatum, verlangen. Die Transaktion unterliegt den mit meiner/unserer Bank vereinbarten Bedingungen. <strong>Debitor:</strong> Kontoinhaber: [creditor_account_holder] Straße: [street] Postleitzahl: [postcode] Stadt: [city] Land: [country] IBAN: [creditor_account_iban] BIC: [creditor_agent_bic] [city], [date], [creditor_account_holder] Dieser Brief wird automatisch erstellt und ist ohne Unterschrift gültig. <hr/> Bitte beachten Sie: Die Frist für die Vorabinformation der SEPA-Lastschrift wird auf einen Tag verkürzt.

source: available placeholders: [creditor_name], [creditor_id], [mandate_id], [creditor_account_holder], [street], [postcode], [city], [country], [creditor_account_iban], [creditor_agent_bic], [city], [date]
de_de: verfügbare Platzhalter: [creditor_name], [creditor_id], [mandate_id], [creditor_account_holder], [street], [postcode], [city], [country], [creditor_account_iban], [creditor_agent_bic], [city], [date]

source: Checkbox agreement
de_de: Checkbox-Vereinbarung

source: Enable "agree to SEPA mandate" checkbox
de_de: Aktivieren Sie das Kontrollkästchen "SEPA-Mandat akzeptieren"

source: If enabled, the user has to accept the SEPA Direct Debit Mandate.
de_de: Wenn aktiviert, muss der Benutzer das SEPA-Lastschrift-Mandat akzeptieren.

source: Checkbox label
de_de: Checkbox-Bezeichnung

source: I hereby agree to the [link]SEPA Direct Debit Mandate[/link].
de_de: Hiermit stimme ich dem [link]SEPA-Lastschrift-Mandat[/link] zu.

source: Mandate ID Format
de_de: Mandats-ID-Format

source: You can change the Mandate ID Format by adding a prefix and/or suffix. [id] is a placeholder for the automatically generated ID.
de_de: Sie können das Mandats-ID-Format ändern, indem Sie ein Präfix und/oder Suffix hinzufügen. [id] ist ein Platzhalter für die automatisch generierte ID.

source: Options
de_de: Optionen

source: Hide IBAN characters
de_de: IBAN-Zeichen ausblenden

source: Select if you want to hide certain characters of an IBAN
de_de: Wählen Sie aus, ob Sie bestimmte Zeichen einer IBAN ausblenden möchten

source: show full IBAN
de_de: volle IBAN anzeigen

source: show last 3 chars
de_de: zeige die letzten 3 Zeichen

source: show last 4 chars
de_de: zeige die letzten 4 Zeichen

source: show first and last 3 chars
de_de: erste und letzte 3 Zeichen anzeigen

source: show first and last 4 chars
de_de: erste und letzte 4 Zeichen anzeigen

source: Encryption is fully configured. The data is stored in encrypted form.
de_de: Die Verschlüsselung ist vollständig konfiguriert. Die Daten werden verschlüsselt gespeichert.

source: Remember for user
de_de: Für Benutzer merken

source: Save account data as user meta if user has/creates a customer account.
de_de: Kontodaten als Benutzer-Metadaten speichern, wenn der Benutzer ein Kundenkonto hat/anlegt.

source: yes
de_de: ja

source: no
de_de: nein

source: This plugin offers the possibility to store the bank data of the users (IBAN, BIC and account holder) encrypted.
de_de: Dieses Plugin bietet die Möglichkeit, die Bankdaten der Benutzer (IBAN, BIC und Kontoinhaber) verschlüsselt zu speichern.

source: If you want to use encryption, just insert the following code in your <a href="%s" target="_blank">wp-config.php</a>
de_de: Wenn Sie Verschlüsselung verwenden möchten, fügen Sie einfach den folgenden Code in Ihr <a href="%s" target="_blank">wp-config.php</a>

source: Remaining credits
de_de: Verbleibende Kredite

source: SEPA direct debit data
de_de: SEPA-Lastschriftdaten

source: SEPA direct debit mandate
de_de: SEPA-Lastschrift-Mandat

source: Support
de_de: Unterstützung
